lcarricart/02-Microcontrollers/04-NXP/03-s32k312-mini-evb/_00_can_rx_fifo/Project_Settings/Startup_Code/startup_ARMCM7.c
/**************************************************************************//**
 * @file     startup_ARMCM7.c
 * @brief    CMSIS Core Device Startup File for
 *           ARMCM7 Device
 * @version  V5.3.1
 * @date     04. June 2019
 ******************************************************************************/
/*
 * Copyright (c) 2009-2019 Arm Limited. All rights reserved.
 * Copyright 2020-2021, 2024, 2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#if defined (ARMCM7)
  #include "ARMCM7.h"
#elif defined (ARMCM7_SP)
  #include "ARMCM7_SP.h"
#elif defined (ARMCM7_DP)
  #include "ARMCM7_DP.h"
#else
  #error device not specified!
#endif

#include "S32K312.h"

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler Function Prototype
 *----------------------------------------------------------------------------*/
typedef void( *pFunc )( void );

/*----------------------------------------------------------------------------
  Peripheral MC_RGM base pointer
 *----------------------------------------------------------------------------*/

#ifndef MC_RGM
#define MC_RGM IP_MC_RGM
#endif

/*----------------------------------------------------------------------------
  External References
 *----------------------------------------------------------------------------*/
extern uint32_t __INITIAL_SP;
#ifdef INIT_STDBY_RAM
extern uint32_t __STDBYRAM_START, __STDBYRAM_SIZE;
#endif

/*----------------------------------------------------------------------------
  Internal References
 *----------------------------------------------------------------------------*/
void __NO_RETURN Default_Handler(void);
#if defined ( __GNUC__ )
void __NAKED __NO_RETURN __attribute__((target("general-regs-only"))) Reset_Handler(void);
#else
void __NAKED __NO_RETURN Reset_Handler(void);
#endif

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/
/* ARM CORE Exceptions */
void __NO_RETURN NMI_Handler            (void) __attribute__ ((weak, alias("Default_Handler")));
void __NO_RETURN HardFault_Handler      (void) __attribute__ ((weak, alias("Default_Handler")));
void __NO_RETURN MemManage_Handler      (void) __attribute__ ((weak, alias("Default_Handler")));
void __NO_RETURN BusFault_Handler       (void) __attribute__ ((weak, alias("Default_Handler")));
void __NO_RETURN UsageFault_Handler     (void) __attribute__ ((weak, alias("Default_Handler")));
void __NO_RETURN SVC_Handler            (void) __attribute__ ((weak, alias("Default_Handler")));
void __NO_RETURN DebugMon_Handler       (void) __attribute__ ((weak, alias("Default_Handler")));
void __NO_RETURN PendSV_Handler         (void) __attribute__ ((weak, alias("Default_Handler")));
void __NO_RETURN SysTick_Handler        (void) __attribute__ ((weak, alias("Default_Handler")));

/* SoC Interrupts */
void __NO_RETURN INT0_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN INT1_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN INT2_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN INT3_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD0_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD1_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD2_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD3_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD4_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD5_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD6_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD7_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD8_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD9_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD10_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD11_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD12_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD13_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD14_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD15_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD16_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD17_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD18_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD19_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD20_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD21_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD22_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD23_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD24_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD25_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD26_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD27_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD28_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD29_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD30_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN DMATCD31_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ERM_0_Handler      (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ERM_1_Handler      (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN MCM_Handler        (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN STM0_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN STM1_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN SWT0_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN SWT1_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FLASH_0_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FLASH_1_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FLASH_2_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN RGM_Handler        (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN PMC_Handler        (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN SIUL_0_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN SIUL_1_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN SIUL_2_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN SIUL_3_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS0_2_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS0_3_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS0_4_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS0_5_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS0_6_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS0_7_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS1_2_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS1_3_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS1_4_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS1_5_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS1_6_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS1_7_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS2_2_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS2_3_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS2_4_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS2_5_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS2_6_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN EMIOS2_7_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN WKPU_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN CMU0_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN CMU1_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN CMU2_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN BCTU_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LCU0_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LCU1_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN PIT0_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN PIT1_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN PIT2_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN RTC_Handler        (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ENET_0_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ENET_1_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ENET_2_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ENET_3_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN0_0_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN0_1_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN0_2_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN0_3_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN1_0_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN1_1_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN1_2_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN2_0_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN2_1_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN2_2_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN3_0_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN3_1_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN4_0_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN4_1_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN5_0_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FlexCAN5_1_Handler (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FLEXIO_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART0_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART1_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART2_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART3_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART4_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART5_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART6_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART7_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART8_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART9_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART10_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART11_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART12_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART13_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART14_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPUART15_Handler   (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPI2C0_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPI2C1_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPSPI0_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPSPI1_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPSPI2_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPSPI3_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPSPI4_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPSPI5_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN QSPI_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN SAI0_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN SAI1_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN JDC_Handler        (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ADC0_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ADC1_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN ADC2_Handler       (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPCMP0_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPCMP1_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN LPCMP2_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FCCU_0_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN FCCU_1_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN HSE_B_0_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN HSE_B_1_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN HSE_B_2_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN HSE_B_3_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN HSE_B_4_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN HSE_B_5_Handler    (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN MU_A_0_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN MU_A_1_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN MU_A_2_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN MU_B_0_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN MU_B_1_Handler     (void) __attribute__((weak, alias ("Default_Handler")));
void __NO_RETURN MU_B_2_Handler     (void) __attribute__((weak, alias ("Default_Handler")));

/*----------------------------------------------------------------------------
  Exception / Interrupt Vector table
 *----------------------------------------------------------------------------*/

#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#endif

extern const pFunc __VECTOR_TABLE[240];
       const pFunc __VECTOR_TABLE[240] __VECTOR_TABLE_ATTRIBUTE =
{
  (pFunc)(&__INITIAL_SP),                   /*     Initial Stack Pointer */
  Reset_Handler,                            /*     Initial Program Counter: Reset Handler */

  NMI_Handler,                              /* -14 NMI Handler */
  HardFault_Handler,                        /* -13 Hard Fault Handler */
  MemManage_Handler,                        /* -12 MPU Fault Handler */
  BusFault_Handler,                         /* -11 Bus Fault Handler */
  UsageFault_Handler,                       /* -10 Usage Fault Handler */
  0,                                        /*     Reserved */
  0,                                        /*     Reserved */
  0,                                        /*     Reserved */
  0,                                        /*     Reserved */
  SVC_Handler,                              /*  -5 SVCall Handler */
  DebugMon_Handler,                         /*  -4 Debug Monitor Handler */
  0,                                        /*     Reserved */
  PendSV_Handler,                           /*  -2 PendSV Handler */
  SysTick_Handler,                          /*  -1 SysTick Handler */

